EDT/УТ/src/Reports/ИнформационныеЛисткиПоЗП/ИнформационныеЛисткиПоЗП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ИнформационныеЛисткиПоЗП</name>
  <attributes>
    <name>ТипЭкипажа</name>
    <type>
      <types>EnumRef.ТипыТарифовРасчетаЗарплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>УчастникЭкипажа</name>
    <type>
      <types>EnumRef.УчастникЭкипажа</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.новаЭкспедиторы</types>
      <types>CatalogRef.новаВодители</types>
    </type>
  </attributes>
</mdclass:Report>

EDT/УТ/src/AccumulationRegisters/РасчетЗарплаты/РасчетЗарплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РасчетЗарплаты</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Подъём</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДоставкаБП</name>
    <type>
      <types>BusinessProcessRef.новаМестнаяДоставка</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтработаноЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Корректировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Регион</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЮрЛицо</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидТарифаРасчетаЗП</name>
    <type>
      <types>CatalogRef.ВидыТарифовРасчетаЗП</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипЭкипажа</name>
    <type>
      <types>EnumRef.ТипыТарифовРасчетаЗарплаты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипТранспорта</name>
    <type>
      <types>CatalogRef.ТипыТранспортаДляРасчетаЗП</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Транспорт</name>
    <type>
      <types>CatalogRef.новаТранспорт</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НаёмныйЭкипаж</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Услуга</name>
    <type>
      <types>CatalogRef.ПоказателиРасчетаУслугСД</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УчастникЭкипажа</name>
    <type>
      <types>EnumRef.УчастникЭкипажа</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КатегорияДоставки</name>
    <type>
      <types>CatalogRef.КатегорииДоставки2014</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.новаЭкспедиторы</types>
      <types>CatalogRef.новаВодители</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипДоставки</name>
    <type>
      <types>EnumRef.ТипыЗаказов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Доставка</name>
    <type>
      <types>DocumentRef.ЗаборТовара</types>
      <types>DocumentRef.Фрахт</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Территориальность</name>
    <type>
      <types>EnumRef.ТерриториальностьДоставок</types>
    </type>
  </dimensions>
  <dimensions>
    <name>VIPДоставка</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидVip</name>
    <type>
      <types>CatalogRef.ВидыVip</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидВыполненияДоставки</name>
    <type>
      <types>EnumRef.ВидыВыполненияДоставокЭкипажами</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РасчетПоМинимальнойСтоимости</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РасчетныйБрейк</name>
    <type>
      <types>CatalogRef.РасчетныеБрейки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТарифнаяСетка</name>
    <type>
      <types>CatalogRef.ТипыТарифов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТарифнаяСеткаПартнера</name>
    <type>
      <types>CatalogRef.ТарифныеСетки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗонаТарификации</name>
    <type>
      <types>CatalogRef.ГруппыРайонов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъёмЗабора</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КатегорияЗаказаДляРасчетаЗП</name>
    <type>
      <types>CatalogRef.КатегорииДоставки2014</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПравилаОпределенияКатегорииЗаказаДляЗП</name>
    <type>
      <types>CatalogRef.ПравилаСопоставленияКатегорийЗаказовДляРасчетаЗП</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

EDT/УТ/src/AccumulationRegisters/СводПоЗарплате/СводПоЗарплате.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>СводПоЗарплате</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПоказательКоличества</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Корректировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Регион</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЮрЛицо</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипРасчетаЗарплаты</name>
    <type>
      <types>EnumRef.ТипыРасчетаЗарплаты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УчастникЭкипажа</name>
    <type>
      <types>EnumRef.УчастникЭкипажа</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Услуга</name>
    <type>
      <types>CatalogRef.ПоказателиРасчетаУслугСД</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.новаЭкспедиторы</types>
      <types>CatalogRef.новаВодители</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипНУ</name>
    <type>
      <types>EnumRef.ТипыНУЭкипажей</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

EDT/УТ/src/Enums/ТипыЗаказов/ТипыЗаказов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыЗаказов</name>
  <enumValues>
    <name>Доставка</name>
  </enumValues>
  <enumValues>
    <name>Самовывоз</name>
  </enumValues>
  <enumValues>
    <name>Забор</name>
  </enumValues>
  <enumValues>
    <name>Фрахт</name>
  </enumValues>
  <enumValues>
    <name>Возврат</name>
  </enumValues>
  <enumValues>
    <name>Обмен</name>
  </enumValues>
</mdclass:Enum>

EDT/УТ/src/Enums/ТипыТарифовРасчетаЗарплаты/ТипыТарифовРасчетаЗарплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыТарифовРасчетаЗарплаты</name>
  <enumValues>
    <name>АрендованныйТранспорт</name>
  </enumValues>
  <enumValues>
    <name>ЭкипажБезЭкспедитора</name>
  </enumValues>
  <enumValues>
    <name>ЭкипажПолный</name>
  </enumValues>
  <enumValues>
    <name>ЭкипажПолныйЭкспедитор</name>
  </enumValues>
  <enumValues>
    <name>ПешийКурьер</name>
  </enumValues>
</mdclass:Enum>

EDT/УТ/src/Enums/УчастникЭкипажа/УчастникЭкипажа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>УчастникЭкипажа</name>
  <enumValues>
    <name>Водитель</name>
  </enumValues>
  <enumValues>
    <name>Экспедитор</name>
  </enumValues>
</mdclass:Enum>

EDT/УТ/src/Enums/ТерриториальностьДоставок/ТерриториальностьДоставок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТерриториальностьДоставок</name>
  <enumValues>
    <name>ДоставкаВПределахМКАД</name>
  </enumValues>
  <enumValues>
    <name>ДоставкаЗаПределыМКАД</name>
  </enumValues>
  <enumValues>
    <name>ДоставкаВПределахКАД</name>
  </enumValues>
  <enumValues>
    <name>ДоставкаЗаПределыКАД</name>
  </enumValues>
</mdclass:Enum>

EDT/УТ/src/Enums/ТипыРасчетаЗарплаты/ТипыРасчетаЗарплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыРасчетаЗарплаты</name>
  <enumValues>
    <name>СдельныйРасчетПоДоставкам</name>
  </enumValues>
  <enumValues>
    <name>РасчетПоОкладу</name>
  </enumValues>
  <enumValues>
    <name>НочныеСмены</name>
  </enumValues>
  <enumValues>
    <name>Магистраль</name>
  </enumValues>
</mdclass:Enum>

EDT/УТ/src/Catalogs/КатегорииДоставки2014/КатегорииДоставки2014.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КатегорииДоставки2014</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>КГТ</name>
      <description>КГТ</description>
    </items>
    <items>
      <name>МГТ</name>
      <description>МГТ</description>
    </items>
    <items>
      <name>СГТ</name>
      <description>СГТ</description>
    </items>
  </predefined>
  <attributes>
    <name>Категория</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Цвет</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоМинутНаРазгрузку</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесПоУмолчанию</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемПоУмолчанию</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТипыТранспорта</name>
    <attributes>
      <name>ТипТранспорта</name>
      <type>
        <types>CatalogRef.ТипыТранспортаДляЛогистики</types>
      </type>
    </attributes>
    <attributes>
      <name>Доступен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НеДоступен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПродолжительностьРазгрузкиПоКомитентам</name>
    <attributes>
      <name>Комитент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ПродолжительностьРазгрузки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Брейки</name>
    <attributes>
      <name>ТипЗаказа</name>
      <type>
        <types>EnumRef.ТипыЗаказов</types>
      </type>
    </attributes>
    <attributes>
      <name>ВесогабаритнаяХарактеристика</name>
      <type>
        <types>EnumRef.ГабаритныеХарактеристикиЗаказа</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеОт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеДо</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

EDT/УТ/src/Reports/ИнформационныеЛисткиПоЗП/ObjectModule.bsl
Функция Сформировать(НачПер, КонПер, Таб) Экспорт
	Зап = Новый Запрос;
	ДопУсловия = "";
	
	Если Не ТипЭкипажа.Пустая() Тогда
		ДопУсловия = " И РасчетЗарплатыОбороты.ТипЭкипажа = &ТипЭкипажа";
		Зап.УстановитьПараметр("ТипЭкипажа", ТипЭкипажа);
	КонецеСли;	
	
	
	Если Не УчастникЭкипажа.Пустая() Тогда
		ДопУсловия = " И РасчетЗарплатыОбороты.УчастникЭкипажа = &УчастникЭкипажа";
		Зап.УстановитьПараметр("УчастникЭкипажа", УчастникЭкипажа);
	КонецеСли;	
	
	Если Не ФизЛицо.Пустая() Тогда
		ДопУсловия = " И РасчетЗарплатыОбороты.ФизЛицо = &ФизЛицо";
		Зап.УстановитьПараметр("ФизЛицо", ФизЛицо);
	КонецеСли;	
	
	
	
	
	Зап.Текст = "ВЫБРАТЬ
	            |	РасчетЗарплатыОбороты.КатегорияДоставки.Родитель.Ссылка КАК КатегорияДоставки,
	            |	ВЫБОР
	            |		КОГДА РасчетЗарплатыОбороты.ТипДоставки = ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Доставка)
	            |			ТОГДА ВЫБОР
	            |					КОГДА РасчетЗарплатыОбороты.ТипЭкипажа = ЗНАЧЕНИЕ(Перечисление.ТипыТарифовРасчетаЗарплаты.ЭкипажПолный)
	            |							И РасчетЗарплатыОбороты.УчастникЭкипажа = ЗНАЧЕНИЕ(Перечисление.УчастникЭкипажа.Водитель)
	            |						ТОГДА ""В2""
	            |					ИНАЧЕ ВЫБОР
	            |							КОГДА РасчетЗарплатыОбороты.ТипЭкипажа = ЗНАЧЕНИЕ(Перечисление.ТипыТарифовРасчетаЗарплаты.ЭкипажПолный)
	            |									И РасчетЗарплатыОбороты.УчастникЭкипажа = ЗНАЧЕНИЕ(Перечисление.УчастникЭкипажа.Экспедитор)
	            |								ТОГДА ""Э2""
	            |							ИНАЧЕ ВЫБОР
	            |									КОГДА РасчетЗарплатыОбороты.ТипЭкипажа = ЗНАЧЕНИЕ(Перечисление.ТипыТарифовРасчетаЗарплаты.ЭкипажБезЭкспедитора)
	            |											И РасчетЗарплатыОбороты.УчастникЭкипажа = ЗНАЧЕНИЕ(Перечисление.УчастникЭкипажа.Водитель)
	            |										ТОГДА ""В1""
	            |									ИНАЧЕ ВЫБОР
	            |											КОГДА РасчетЗарплатыОбороты.НаёмныйЭкипаж = ИСТИНА
	            |												ТОГДА ""ВСМ""
	            |											ИНАЧЕ ""--""
	            |										КОНЕЦ
	            |								КОНЕЦ
	            |						КОНЕЦ
	            |				КОНЕЦ
	            |		ИНАЧЕ ""--""
	            |	КОНЕЦ КАК КатегорияЭкипажа,
	            |	РасчетЗарплатыОбороты.ФизЛицо КАК ФизЛицо,
	            |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ РасчетЗарплатыОбороты.Доставка.Ссылка) КАК КоличествоЗаказов,
	            |	РасчетЗарплатыОбороты.Территориальность КАК Территориальность
	            |ИЗ
	            |	РегистрНакопления.РасчетЗарплаты.Обороты(&НачПериода, &КонПериода, , ) КАК РасчетЗарплатыОбороты
	            |ГДЕ
	            |	1 = 1 " + ДопУсловия + "
	            |
	            |СГРУППИРОВАТЬ ПО
	            |	РасчетЗарплатыОбороты.КатегорияДоставки.Родитель.Ссылка,
	            |	РасчетЗарплатыОбороты.ФизЛицо,
	            |	РасчетЗарплатыОбороты.Территориальность,
	            |	ВЫБОР
	            |		КОГДА РасчетЗарплатыОбороты.ТипДоставки = ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Доставка)
	            |			ТОГДА ВЫБОР
	            |					КОГДА РасчетЗарплатыОбороты.ТипЭкипажа = ЗНАЧЕНИЕ(Перечисление.ТипыТарифовРасчетаЗарплаты.ЭкипажПолный)
	            |							И РасчетЗарплатыОбороты.УчастникЭкипажа = ЗНАЧЕНИЕ(Перечисление.УчастникЭкипажа.Водитель)
	            |						ТОГДА ""В2""
	            |					ИНАЧЕ ВЫБОР
	            |							КОГДА РасчетЗарплатыОбороты.ТипЭкипажа = ЗНАЧЕНИЕ(Перечисление.ТипыТарифовРасчетаЗарплаты.ЭкипажПолный)
	            |									И РасчетЗарплатыОбороты.УчастникЭкипажа = ЗНАЧЕНИЕ(Перечисление.УчастникЭкипажа.Экспедитор)
	            |								ТОГДА ""Э2""
	            |							ИНАЧЕ ВЫБОР
	            |									КОГДА РасчетЗарплатыОбороты.ТипЭкипажа = ЗНАЧЕНИЕ(Перечисление.ТипыТарифовРасчетаЗарплаты.ЭкипажБезЭкспедитора)
	            |											И РасчетЗарплатыОбороты.УчастникЭкипажа = ЗНАЧЕНИЕ(Перечисление.УчастникЭкипажа.Водитель)
	            |										ТОГДА ""В1""
	            |									ИНАЧЕ ВЫБОР
	            |											КОГДА РасчетЗарплатыОбороты.НаёмныйЭкипаж = ИСТИНА
	            |												ТОГДА ""ВСМ""
	            |											ИНАЧЕ ""--""
	            |										КОНЕЦ
	            |								КОНЕЦ
	            |						КОНЕЦ
	            |				КОНЕЦ
	            |		ИНАЧЕ ""--""
	            |	КОНЕЦ
	            |
	            |УПОРЯДОЧИТЬ ПО
	            |	РасчетЗарплатыОбороты.ФизЛицо.Наименование
	            |ИТОГИ
	            |	СУММА(КоличествоЗаказов)
	            |ПО
	            |	ФизЛицо,
	            |	КатегорияДоставки,
	            |	Территориальность,
	            |	КатегорияЭкипажа";
				
	Зап.УстановитьПараметр("НачПериода", НачалоДня(НачПер));			
	Зап.УстановитьПараметр("КонПериода", КонецДня(КонПер));			
	
	
	
	ТабТер = Новый ТаблицаЗначений;
	ТабТер.Колонки.добавить("Территориальность");
	Нов = ТабТер.Добавить();
	Нов.Территориальность = Перечисления.ТерриториальностьДоставок.ДоставкаВПределахМКАД;
	Нов = ТабТер.Добавить();
	Нов.Территориальность = Перечисления.ТерриториальностьДоставок.ДоставкаЗаПределыМКАД;
	
	ТабКат = Новый ТаблицаЗначений;
	ТабКат.Колонки.Добавить("КатегорияДоставки");
	Нов = ТабКат.Добавить();
	Нов.КатегорияДоставки = Справочники.КатегорииДоставки2014.МГТ;
	Нов = ТабКат.Добавить();
	Нов.КатегорияДоставки = Справочники.КатегорииДоставки2014.СГТ;
	Нов = ТабКат.Добавить();
	Нов.КатегорияДоставки = Справочники.КатегорииДоставки2014.КГТ;

	
	Рез = Зап.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	
	ЗапПр = Новый Запрос;
	ЗапПр.Текст = "ВЫБРАТЬ
	              |	РасчетЗарплатыОбороты.ФизЛицо,
	              |	""Подъем"" КАК Начисление,
	              |	СУММА(РасчетЗарплатыОбороты.ПодъёмОборот) КАК Сумма,
	              |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ РасчетЗарплатыОбороты.Доставка.Ссылка) КАК Количество
	              |ИЗ
	              |	РегистрНакопления.РасчетЗарплаты.Обороты(&НачДата, &КонДата, , ) КАК РасчетЗарплатыОбороты
	              |
	              |СГРУППИРОВАТЬ ПО
	              |	РасчетЗарплатыОбороты.ФизЛицо
	              |
	              |ОБЪЕДИНИТЬ ВСЕ
	              |
	              |ВЫБРАТЬ
	              |	РасчетЗарплатыОбороты.ФизЛицо,
	              |	""Забор"",
	              |	СУММА(РасчетЗарплатыОбороты.СуммаОборот),
	              |	0
	              |ИЗ
	              |	РегистрНакопления.РасчетЗарплаты.Обороты(&НачДата, &КонДата, , ) КАК РасчетЗарплатыОбороты
	              |ГДЕ
	              |	РасчетЗарплатыОбороты.ТипДоставки = ЗНАЧЕНИЕ(перечисление.типыЗаказов.Забор)
	              |
	              |СГРУППИРОВАТЬ ПО
	              |	РасчетЗарплатыОбороты.ФизЛицо
	              |
	              |ОБЪЕДИНИТЬ ВСЕ
	              |
	              |ВЫБРАТЬ
	              |	РасчетЗарплатыОбороты.ФизЛицо,
	              |	""Фрахт"",
	              |	СУММА(РасчетЗарплатыОбороты.СуммаОборот),
	              |	0
	              |ИЗ
	              |	РегистрНакопления.РасчетЗарплаты.Обороты(&НачДата, &КонДата, , ) КАК РасчетЗарплатыОбороты
	              |ГДЕ
	              |	РасчетЗарплатыОбороты.ТипДоставки = ЗНАЧЕНИЕ(перечисление.типыЗаказов.фрахт)
	              |
	              |СГРУППИРОВАТЬ ПО
	              |	РасчетЗарплатыОбороты.ФизЛицо
	              |
	              |ОБЪЕДИНИТЬ ВСЕ
	              |
	              |ВЫБРАТЬ
	              |	СводПоЗарплатеОбороты.ФизЛицо,
	              |	""Ночные"",
	              |	СводПоЗарплатеОбороты.СуммаОборот,
	              |	0
	              |ИЗ
	              |	РегистрНакопления.СводПоЗарплате.Обороты(&НачДата, &КонДата, , ) КАК СводПоЗарплатеОбороты
	              |ГДЕ
	              |	СводПоЗарплатеОбороты.ТипРасчетаЗарплаты.Ссылка = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетаЗарплаты.НочныеСмены)";
	ЗапПр.УстановитьПараметр("НачДата", НачалоДня(НачПер));			
	ЗапПр.УстановитьПараметр("КонДата", КонецДня(КонПер));		
	
	РезПр = ЗапПр.Выполнить().Выгрузить();
	
	ТабПр = Новый ТаблицаЗначений;
	ТабПр.Колонки.Добавить("Начисление");
	Нов = ТабПр.Добавить();
	Нов.Начисление = "Подъем";
	Нов = ТабПр.Добавить();
	Нов.Начисление = "Забор";
	Нов = ТабПр.Добавить();
	Нов.Начисление = "Фрахт";
	Нов = ТабПр.Добавить();
	Нов.Начисление = "Ночные";
	
	
	
	Мак = ПолучитьМакет("Макет");
	
	Ш = Мак.ПолучитьОбласть("Шапка|ШапкаВерт");
	ШК = Мак.ПолучитьОбласть("Шапка|Категория");
	
	П = Мак.ПолучитьОбласть("Подвал|ШапкаВерт");
	ПК = Мак.ПолучитьОбласть("Подвал|Категория");
	
	С = Мак.ПолучитьОбласть("Строка|ШапкаВерт");
	СК = Мак.ПолучитьОбласть("Строка|Категория");
	
	С2 = Мак.ПолучитьОбласть("Строка2|ШапкаВерт");
	С2К = Мак.ПолучитьОбласть("Строка2|Категория");
	
	С3 = Мак.ПолучитьОбласть("Строка3|ШапкаВерт");
	С3К = Мак.ПолучитьОбласть("Строка3|Категория");
	
	Таб.Очистить();
	
	Для Каждого ТекФ Из Рез.Строки Цикл
		Ш.Параметры.ФизЛицо =  ТекФ.ФизЛицо;
		Таб.Вывести(Ш);
		
		ШК.Параметры.Территориальность = "МКАД";
		ШК.Параметры.ТЭ1 = "В2";
		ШК.Параметры.ТЭ2 = "Э2";
		ШК.Параметры.ТЭ3 = "В1";
		ШК.Параметры.ТЭ4 = "ВСМ";
		ШК.Параметры.Заг = "Информационный листок";
		ШК.Параметры.Период = "";
		
		Если ТипЗнч(ТекФ.ФизЛицо) = Тип("СправочникСсылка.новаВодители") Тогда
			ШК.Параметры.Должность = "водитель";
		ИначеЕсли ТипЗнч(ТекФ.ФизЛицо) = Тип("СправочникСсылка.новаЭкспедиторы") Тогда
			ШК.Параметры.Должность = "экпедитор";
		КонецеСли;	
		
		Таб.Присоединить(ШК);
		
		
		ШК.Параметры.Территориальность = "За МКАД";
		ШК.Параметры.ТЭ1 = "В2";
		ШК.Параметры.ТЭ2 = "Э2";
		ШК.Параметры.ТЭ3 = "В1";
		ШК.Параметры.ТЭ4 = "ВСМ";
		ШК.Параметры.Должность = "";
		ШК.Параметры.Заг = "";
		ШК.Параметры.Период = ПредставлениеПериода(НачалоДня(НачПер), КонецДня(КонПер));
		Таб.Присоединить(ШК);
		
		
		Для Каждого ТекК Из ТабКат Цикл
			НайК = ТекФ.Строки.Найти(ТекК.КатегорияДоставки);
			С.Параметры.Категория = ТекК.КатегорияДоставки;
			Таб.Вывести(С);
			
			Если НайК <> Неопределено Тогда
				Для Каждого ТекТ Из ТабТер Цикл
					СК.Параметры.П1 = 0;
					СК.Параметры.П2 = 0;
					СК.Параметры.П3 = 0;
					СК.Параметры.П4 = 0;
					НайТ = НайК.Строки.Найти(ТекТ.Территориальность);
					Если НайТ <> Неопределено Тогда
						Для Каждого ТекКЭ Из НайТ.Строки Цикл
							Если ТекКЭ.КатегорияЭкипажа = "В2" Тогда
								СК.Параметры.П1 = ТекКЭ.КоличествоЗаказов;
							ИначеЕсли ТекКЭ.КатегорияЭкипажа = "Э2" Тогда	
								СК.Параметры.П2 = ТекКЭ.КоличествоЗаказов;
							ИначеЕсли ТекКЭ.КатегорияЭкипажа = "В1" Тогда	
								СК.Параметры.П3 = ТекКЭ.КоличествоЗаказов;
							ИначеЕсли ТекКЭ.КатегорияЭкипажа = "ВСМ" Тогда	
								СК.Параметры.П4 = ТекКЭ.КоличествоЗаказов;
							КонецЕсли;	
						КонецЦикла;	
					КонецеСли;
					Таб.Присоединить(СК);
				КонецЦикла;	
			Иначе
				Для Каждого ТекТ Из ТабТер Цикл
					СК.Параметры.П1 = 0;
					СК.Параметры.П2 = 0;
					СК.Параметры.П3 = 0;
					СК.Параметры.П4 = 0;
					Таб.Присоединить(СК);
				КонецЦикла;	
			КонецеСли;	
		КонецЦикла;	
		
		Для Каждого ТекПр Из ТабПр  Цикл
			С3.Параметры.Начисление = ТекПр.Начисление;
			Таб.Вывести(С3);
			
			Струк = Новый Структура;
			Струк.Вставить("ФизЛицо", ТекФ.ФизЛицо);
			Струк.Вставить("Начисление", ТекПр.Начисление);
			
			НайСтроки = РезПр.НайтиСтроки(Струк);
			
			Если НайСтроки.Количество() <> 0 Тогда
				С3К.Параметры.П = НайСтроки[0].Количество;
				Таб.Присоединить(С3К);
				С3К.Параметры.П = НайСтроки[0].Сумма;
				Таб.Присоединить(С3К);
			Иначе
				С3К.Параметры.П = 0;
				Таб.Присоединить(С3К);
				Таб.Присоединить(С3К);
			КонецеСли;	
			
		КонецЦикла;
		
		Таб.Вывести(П);
		Для Сч = 1 По 2 Цикл
			Таб.Присоединить(ПК);
		КонецЦикла;	
	КонецЦикла;	
	
	Возврат Истина;
КонецФункции
